week 7/W7D3/capybara_music_app_hw/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @band = Band.find_by(id: params[:id])

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "acdc"], ["created_at", "2020-12-08 22:46:59.383652"], ["updated_at", "2020-12-08 22:46:59.383652"]]
---
    def create
        @band = Band.new(band_params)
        if @band.save