week 7/W7D3/capybara_music_app_hw/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "me@gmail.com"], ["LIMIT", 1]]
---
    def self.find_by_email(email, password)
        user = User.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "hMhN2QgdEyOqepsVZbMg0g"], ["updated_at", "2020-12-08 20:37:50.035648"], ["id", 1]]
---
    def reset_session_token!
        self.update!(session_token: self.class.generate_session_token)